fix: set giscus repoId and categoryId
